//KC02762R JOB 1,'SRINIVAS  ',NOTIFY=&SYSUID
//**************************************************
//* EXECUTE THE PROGRAM
//STEP10  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSIN    DD  *
     DELETE 'KC02762.TSU.CUSTNEW'
/*
//COBEXE   EXEC PGM=CSTMAINT
//STEPLIB  DD DSN=KC02762.TSU.LOAD,DISP=SHR
//CUSTOLD  DD DSN=KC02762.TSU.CUSTOLD,DISP=SHR
//CUSTNEW  DD DSN=KC02762.TSU.CUSTNEW,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=80,DSORG=PS,BLKSIZE=0),
//            SPACE=(CYL,(1,1),RLSE)
//SYSOUT   DD SYSOUT=*
/*
