//KC02762R JOB 1,'SRINIVAS  ',NOTIFY=&SYSUID
//**************************************************
//* EXECUTE THE PROGRAM
//STEP10  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSIN    DD  *
     DELETE 'KC02762.TSU.AFTRMERG'
/*
//COBEXE   EXEC PGM=MERGPG01
//STEPLIB  DD DSN=KC02762.TSU.LOAD,DISP=SHR
//INFIL1   DD DSN=KC02762.TSU.INPTFIL1,DISP=SHR
//INFIL2   DD DSN=KC02762.TSU.INPTFIL2,DISP=SHR
//WRKFILE  DD DSN=&&TEMP
//OUTFILE  DD DSN=KC02762.TSU.AFTRMERG,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=30,DSORG=PS,BLKSIZE=0),
//            SPACE=(CYL,(1,1),RLSE)
//SYSOUT   DD SYSOUT=*
/*
