//KC02762R JOB 1,'SRINIVAS  ',NOTIFY=&SYSUID
//**************************************************
//* EXECUTE THE PROGRAM
//STEP10  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSIN    DD  *
     DELETE 'KC02762.TSU.MERGEJCL'
/*
//STEP20   EXEC PGM=SORT
//SYSOUT   DD  SYSOUT=*
//SORTIN01 DD DSN=KC02762.TSU.INPTFIL1,DISP=SHR
//SORTIN02 DD DSN=KC02762.TSU.INPTFIL2,DISP=SHR
//SORTOUT  DD DSN=KC02762.TSU.MERGEJCL,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=30,DSORG=PS,BLKSIZE=0),
//            SPACE=(CYL,(1,1),RLSE)
//SYSIN    DD *
  MERGE FIELDS=(1,5,A,6,25,D),FORMAT=CH
/*
