//KC02762R JOB 1,'SRINIVAS  ',NOTIFY=&SYSUID
//**************************************************
//* EXECUTE THE PROGRAM
//STEP10  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSIN    DD  *
     DELETE 'KC02762.TSU.REGSREP2'
/*
//COBEXE   EXEC PGM=REGIREP2
//STEPLIB  DD DSN=KC02762.TSU.LOAD,DISP=SHR
//REGSFILE DD DSN=KC02762.TSU.REGSFILE,DISP=SHR
//REGSREP2 DD DSN=KC02762.TSU.REGSREP2,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=133,DSORG=PS,BLKSIZE=0),
//            SPACE=(CYL,(1,1),RLSE)
//SYSOUT   DD SYSOUT=*
/*
