//KC02762R JOB 1,'SRINIVAS  ',NOTIFY=&SYSUID
//**************************************************
//* EXECUTE THE PROGRAM
//**************************************************
//COBEXE   EXEC PGM=RPRT1001
//STEPLIB  DD DSN=KC02762.TSU.LOAD,DISP=SHR
//CUSTMAST DD DSN=KC02762.TSU.CUSTMAST.DATA,DISP=SHR
//SALESRPT DD DSN=KC02762.SALESRPT.DATAB,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=132,DSORG=PS,BLKSIZE=0),
//            SPACE=(CYL,(1,1),RLSE)
//BRANCHFL DD DSN=KC02762.BRANCHFL.DATAB,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=132,DSORG=PS,BLKSIZE=0),
//            SPACE=(CYL,(1,1),RLSE)
//SYSOUT   DD SYSOUT=*
/*
