//KC02762R JOB 1,'SRINIVAS  ',NOTIFY=&SYSUID
//**************************************************
//* EXECUTE THE PROGRAM
//STEP10  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSIN    DD  *
     DELETE 'KC02762.SALESRPT.DATA2'
/*
//COBEXE   EXEC PGM=RPRT1000
//STEPLIB  DD DSN=KC02762.TSU.LOAD,DISP=SHR
//CUSTMAST DD DSN=KC02762.TSU.CUSTMAST.DATA,DISP=SHR
//SALESRPT DD DSN=KC02762.SALESRPT.DATA2,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=132,DSORG=PS,BLKSIZE=0),
//            SPACE=(CYL,(1,1),RLSE)
//SYSOUT   DD SYSOUT=*
/*
