//KC02762R JOB 1,'SRINIVAS  ',NOTIFY=&SYSUID
//**************************************************
//* EXECUTE THE PROGRAM
//STEP10  EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSIN    DD  *
     DELETE 'KC02762.TSU.AFTRSORT'
/*
//COBEXE   EXEC PGM=SORTPG02
//STEPLIB  DD DSN=KC02762.TSU.LOAD,DISP=SHR
//INFILE   DD DSN=KC02762.TSU.INPTMAST,DISP=SHR
//WRKFILE  DD DSN=&&TEMP
//OUTFILE  DD DSN=KC02762.TSU.AFTRSORT,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=FB,LRECL=30,DSORG=PS,BLKSIZE=0),
//            SPACE=(CYL,(1,1),RLSE)
//SYSOUT   DD SYSOUT=*
/*
