        IDENTIFICATION DIVISION.
        PROGRAM-ID. MERGPG01.

        ENVIRONMENT DIVISION.
        INPUT-OUTPUT SECTION.
        FILE-CONTROL.
            SELECT INPUT-FILE1 ASSIGN TO INFIL1.
            SELECT INPUT-FILE2 ASSIGN TO INFIL2.
            SELECT OUTPUT-FILE ASSIGN TO OUTFILE.
            SELECT WORK-FILE ASSIGN TO WORKFILE.

        DATA DIVISION.
        FILE SECTION.
        FD INPUT-FILE1.
        01 INPUT-STUDENT1.
         05 STUDENT-ID-I1    PIC 9(5).
         05 STUDENT-NAME-I1  PIC X(25).
         FD INPUT-FILE2.
        01 INPUT-STUDENT2.
         05 STUDENT-ID-I2    PIC 9(5).
         05 STUDENT-NAME-I2  PIC X(25).
        FD  OUTPUT-FILE.
        01 OUTPUT-STUDENT.
         05 STUDENT-ID-O    PIC 9(5).
         05 STUDENT-NAME-O  PIC X(25).
        SD WORK-FILE.
        01 WORK-STUDENT.
         05 STUDENT-ID-W    PIC 9(5).
         05 STUDENT-NAME-W  PIC X(25).

        PROCEDURE DIVISION.
            MERGE WORK-FILE ON ASCENDING KEY STUDENT-ID-W
            USING INPUT-FILE1 INPUT-FILE2 GIVING OUTPUT-FILE.
            DISPLAY 'Merge Successful'.
            STOP RUN.
